Merge branch 'main' of https://github.com/JayAlvn/Fraud-Detection-RAG-Pipeline
# Conflicts:
#	backend/pipeline/pipeline.py
